Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled Property
 Contextual Analytical Model not enabled. File open was canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContextualAnalyticalModelModeNotEnabled { get; }
Public Shared ReadOnly Property ContextualAnalyticalModelModeNotEnabled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContextualAnalyticalModelModeNotEnabled {
	FailureDefinitionId^ get ();
}
static member ContextualAnalyticalModelModeNotEnabled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace